{
  "help": "Help",
  "app": "App",
  "piano": "Piano",
  "about": "About",
  "basicMode": "Basic",
  "advancedMode": "Advanced",
  "proMode": "Pro",
  "reassign": "Reassign",
  "validate": "Validate",
  "double": "Double",
  "single": "Single",
  "full": "Full",
  "keys": "Keys",
  "sounds": "Sounds",
  "disabled": "Disabled",
  "reset": "Reset",
  "save": "Save",
  "upload": "Upload",
  "helpVisualModes": "Visual modes",
  "helpVisualModesText": "You can switch the modes by clicking corresponding buttons on the piano settings.",
  "helpVisualModesDouble": "Double mode: represents 37 piano keys similar to way keyboard keys are placed on computer's keyboard;",
  "helpVisualModesSingle": "Single mode: represents 37 piano keys placed in one row;",
  "helpVisualModesFull": "Full mode: represents full piano keyboard.",
  "helpFunctionalModes": "Functional modes",
  "helpFunctionalModesText": "You can switch the modes by clicking corresponding buttons on the piano settings.",
  "helpFunctionalModesBasic": "Basic mode: represents three full adjacent octaves and allows to move them to the left or to the right;",
  "helpFunctionalModesAdvanced": "Advanced mode: represents three full adjacent octaves and allows you to reassign each of them separately;",
  "helpFunctionalModesPro": "Pro mode: represents three full adjacent octaves and allows you to reassign each computer's key to any of piano keys.",
  "helpEditing": "Editing",
  "helpEditingText": "There are two ways for editing for each of modes: by clicking or pressing hotkey combinations. For editing by clicks you need to activate the \"Reassign\" button on the piano settings first.",
  "helpEditingBasicClicking": "Basic mode (clicking): move cursor over the octave you want to be central and click;",
  "helpEditingBasicHotkeys": "Basic mode (hotkeys): press and hold \"Shift\" and press num button with octave number you want to be central;",
  "helpEditingAdvancedClicking": "Advanced mode (clicking): move cursor over the octave you want to refuse and click it. Move cursor over the octave you want to assign and click it;",
  "helpEditingAdvancedHotkeys": "Advanced mode (hotkeys): activate \"Reassign\" button first. Then press and hold \"Shift\" key. Then press any of assigned to octaves keyboard keys for selecting an octave you want to refuse. Finally, press num button with octave number you want to assign for;",
  "helpEditingProClicking": "Pro mode (clicking): move cursor over the piano key you want to refuse and click it. Move cursor over the piano key you want to assign and click it;",
  "helpEditingProHotkeys": "Pro mode (hotkeys): activate \"Reassign\" button first. Then enter note code to input field and validate it. Then press and hold \"Shift\" key. Finally, press one of any already assigned keyboard keys to piano keys for reassign it to the note.",
  "helpChanging": "Changing layouts",
  "helpChangingText": "For Advanced and Pro modes there are several layouts. You can edit one layout and then switch to one of other layouts of selected mode. Press and hold \"Shift\" key. Then press num button for changing active layout. Current active layout numbers are displayed on mode buttons on piano settings.",
  "helpHints": "Visual hints",
  "helpHintsText": "You can toggle visibility of different hints (assigned keys and sound) and disabled keys displaying as well by clicking corresponding buttons.",
  "helpFeatures": "Other features",
  "helpFeaturesReset": "\"Reset\" button: resets all layouts to default; you can also use it if encounter strange behaviour;",
  "helpFeaturesSave": "\"Save\" button: saves all layouts to file which you can use later;",
  "helpFeaturesUpload": "\"Upload\" button: uploads saved layouts from file to the piano.",
  "of": "of",
  "appSettings": "App settings",
  "appSettingsLang": "Language settings",
  "appSettingsEn": "En",
  "appSettingsRu": "Ru",
  "appSettingsStyle": "Style settings",
  "appSettingsClassic": "Classic",
  "appSettingsOriginal": "Original",
  "appSettingsOther": "Other settings",
  "appSettingsIntro": "Show intro after reload",
  "appSettingsHint": "Show hint after reload",
  "appSettingsReset": "Reset all app settings",
  "pianoApp": "Piano app",
  "pianoAppUsed": "Used",
  "pianoAppContacts": "Contacts",
  "pianoAppContactsText": "For any suggestions and questions please contact me:",
  "introSimple": "simple",
  "introPowerful": "powerful",
  "introPiano": "piano",
  "hintTitle": "Hints",
  "hintTextGeneral": "Use PC/laptop keyboard keys for playing",
  "hintTextPiano": "You can change piano layout and functionality by accessing piano settings (click \"Piano\" button)",
  "hintTextApp": "You can also change some app settings (click \"App\" button)",
  "hintTextHelp": "For detailed guide click \"Help\" button",
  "hintTextAbout": "For any suggestions contact me (click \"About\" button for my e-mail address)"
}