{
  "help": "Помощь",
  "app": "Прил.",
  "piano": "Ф-но",
  "about": "О прил.",
  "basicMode": "Базовый",
  "advancedMode": "Любит.",
  "proMode": "Продвин.",
  "reassign": "Переназн.",
  "validate": "Проверить",
  "double": "Два ряда",
  "single": "Один ряд",
  "full": "Полная",
  "keys": "Клавиши",
  "sounds": "Звуки",
  "disabled": "Отключенные",
  "reset": "Сбросить",
  "save": "Сохранить",
  "upload": "Загрузить",
  "helpVisualModes": "Режимы отображения",
  "helpVisualModesText": "Вы можете менять режимы, нажимая на соответствующие кнопки в настройках фортепиано.",
  "helpVisualModesDouble": "Два ряда: 37 клавиш фортепиано, расположенных аналогично клавишам компьютера;",
  "helpVisualModesSingle": "Один ряд: 37 клавиш фортепиано, расположенных в один ряд;",
  "helpVisualModesFull": "Полная: полная клавиатура фортепиано.",
  "helpFunctionalModes": "Функциональные режимы",
  "helpFunctionalModesText": "Вы можете менять режимы, нажимая на соответствующие кнопки в настройках фортепиано.",
  "helpFunctionalModesBasic": "Базовый: представляет 3 соседние октавы и позволяет их смещать влево или вправо",
  "helpFunctionalModesAdvanced": "Любительский: представляет 3 соседние октавы и позволяет смещать каждую отдельно",
  "helpFunctionalModesPro": "Продвинутый: представляет 3 соседние октавы и позволяет переназначать каждую клавишу",
  "helpEditing": "Редактирование",
  "helpEditingText": "Для каждого режима доступно два способа редактирования: кликами мышкой или клавишами клавиатуры. Для редактирования кликами мышкой нужно сначала активировать режим \"Переназначения\" в настройках фортепиано.",
  "helpEditingBasicClicking": "Базовый режим (клик): передвиньте курсор на ту октаву, которую хотите сделать центральной, и нажмите;",
  "helpEditingBasicHotkeys": "Базовый режим (клавиши): зажмите \"Shift\" и нажмите клавишу с номером той октавы, которую хотите сделать центральной;",
  "helpEditingAdvancedClicking": "Любительский режим (клик): сначала нажмите на октаву, которую хотите освободить. Затем нажмите на октаву, которую хотите назначить;",
  "helpEditingAdvancedHotkeys": "Любительский режим (клавиши): сначала активируйте режим \"Переназначения\". Зажмите \"Shift\". Нажмите на любую клавишу, присвоенную октаве, которую хотите освободить. Нажмите на клавишу с номером той октавы, которую хотите назначить;",
  "helpEditingProClicking": "Продвинутый режим (клик): нажмите на клавишу, которую хотите освободить. Нажмите на клавишу, которую хотите назначить;",
  "helpEditingProHotkeys": "Продвинутый режим (клавиши): сначала активируйте режим \"Переназначения\". Введите обозначение ноты, которую хотите присвоить, и нажмите на кнопку \"Проверить\". Зажмите \"Shift\". Нажмите на клавишу, которые вы хотите переназначить.",
  "helpChanging": "Смена раскладок",
  "helpChangingText": "Для любительского и продвинутого режимов доступно несколько раскладок. Вы можете отредактировать одну раскладку и потом переключиться на другую из того же режима. Зажмите \"Shift\" и нажмите клавишу с номером раскладки, которую вы хотите выбрать.",
  "helpHints": "Визуальные подсказки",
  "helpHintsText": "Вы можете переключать отображение различных визуальных подсказок (клавиш, звуков) и отключенных клавиш кликами на соответствующие кнопки в настройках фортепиано.",
  "helpFeatures": "Другие возможности",
  "helpFeaturesReset": "Кнопка \"Сбросить\": сбрасывает все раскладки к начальному состоянию. Также Вы можете её использовать, если столкнётесь с неожиданным поведением;",
  "helpFeaturesSave": "Кнопка \"Сохранить\": сохраняет все раскладки в файл, который Вы можете использовать в дальнейшем;",
  "helpFeaturesUpload": "Кнопка \"Загрузить\": загружает сохранённые раскладки из файла в приложение.",
  "of": "из",
  "appSettings": "Настройки приложения",
  "appSettingsLang": "Выбор языка",
  "appSettingsEn": "Англ.",
  "appSettingsRu": "Рус.",
  "appSettingsStyle": "Выбор стиля",
  "appSettingsClassic": "Классич.",
  "appSettingsOriginal": "Оригин.",
  "appSettingsOther": "Другие настройки",
  "appSettingsIntro": "Показывать интро",
  "appSettingsHint": "Показывать подсказки",
  "appSettingsReset": "Сбросить всё",
  "pianoApp": "Фортепиано",
  "pianoAppUsed": "Использовано",
  "pianoAppContacts": "Контакты",
  "pianoAppContactsText": "По любым предложениям, пожалуйста, свяжитесь со мной:",
  "introSimple": "понятное",
  "introPowerful": "функциональное",
  "introPiano": "фортепиано",
  "hintTitle": "Подсказки",
  "hintTextGeneral": "Используйте клавиши клавиатуры для игры",
  "hintTextPiano": "Вы можете сменить схему и функциональность в настройках ф-но (кликните на кнопку \"Ф-но\")",
  "hintTextApp": "Вы также можете сменить настройки приложения (кликните на кнопку \"Прил.\")",
  "hintTextHelp": "Для детального руководства кликните на кнопку \"Помощь\"",
  "hintTextAbout": "По любым вопросам свяжитесь со мной (кликните на кнопку \"О прил.\" для моего e-mail адреса)"
}